InformationRegisters/НастройкаПравНазначенияИсполнителей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НастройкаПравНазначенияИсполнителей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГруппаИсполнителейЗадачНазначающий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыИсполнителейЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>НазначающийИсполнителей</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиИсполнителей</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РольИсполнителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиИсполнителей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОсновнойОбъектАдресацииИсполнителя</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ОбъектыАдресацииЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОсновнойОбъектАдресацииНазначающего</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ОбъектыАдресацииЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДополнительныйОбъектАдресацииИсполнителя</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ОбъектыАдресацииЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДополнительныйОбъектАдресацииНазначающего</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ОбъектыАдресацииЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НастройкаПравНазначенияИсполнителей/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	НазначающийИсполнителейПредставление = ПроцессыОбработкиДокументовКлиентСервер.ПредставлениеИсполнителяЭтапа(Запись.НазначающийИсполнителей,
																									Запись.ОсновнойОбъектАдресацииНазначающего,
																									Запись.ДополнительныйОбъектАдресацииНазначающего);
	
	РольИсполнителяПредставление = ПроцессыОбработкиДокументовКлиентСервер.ПредставлениеИсполнителяЭтапа(Запись.РольИсполнителя,
																							Запись.ОсновнойОбъектАдресацииИсполнителя,
																							Запись.ДополнительныйОбъектАдресацииИсполнителя);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если НЕ ЗначениеЗаполнено(ТекущийОбъект.ОсновнойОбъектАдресацииНазначающего) Тогда
		ТекущийОбъект.ОсновнойОбъектАдресацииНазначающего = Неопределено;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ТекущийОбъект.ДополнительныйОбъектАдресацииНазначающего) Тогда
		ТекущийОбъект.ДополнительныйОбъектАдресацииНазначающего = Неопределено;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ТекущийОбъект.ОсновнойОбъектАдресацииИсполнителя) Тогда
		ТекущийОбъект.ОсновнойОбъектАдресацииИсполнителя = Неопределено;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ТекущийОбъект.ДополнительныйОбъектАдресацииИсполнителя) Тогда
		ТекущийОбъект.ДополнительныйОбъектАдресацииИсполнителя = Неопределено;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НазначающийИсполнителейНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПроцессыОбработкиДокументовКлиент.ВыбратьИсполнителя(Элемент, Запись.НазначающийИсполнителей, , Ложь, "Выбор назначающего");
	
КонецПроцедуры

&НаКлиенте
Процедура РольИсполнителяНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПроцессыОбработкиДокументовКлиент.ВыбратьИсполнителя(Элемент, Запись.РольИсполнителя, Истина, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура НазначающийИсполнителейОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Модифицированность = Истина;
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		Запись.НазначающийИсполнителей = ВыбранноеЗначение.РольИсполнителя;
		Запись.ОсновнойОбъектАдресацииНазначающего = ВыбранноеЗначение.ОсновнойОбъектАдресации;
		Запись.ДополнительныйОбъектАдресацииНазначающего = ВыбранноеЗначение.ДополнительныйОбъектАдресации;
	Иначе
		Запись.НазначающийИсполнителей = ВыбранноеЗначение;
		Запись.ОсновнойОбъектАдресацииНазначающего = "";
		Запись.ДополнительныйОбъектАдресацииНазначающего = "";
	КонецЕсли;
	
	ВыбранноеЗначение = ПроцессыОбработкиДокументовКлиентСервер.ПредставлениеИсполнителяЭтапа(Запись.НазначающийИсполнителей,
																									Запись.ОсновнойОбъектАдресацииНазначающего,
																									Запись.ДополнительныйОбъектАдресацииНазначающего);
	
КонецПроцедуры

&НаКлиенте
Процедура РольИсполнителяОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Модифицированность = Истина;
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		Запись.РольИсполнителя = ВыбранноеЗначение.РольИсполнителя;
		Запись.ОсновнойОбъектАдресацииИсполнителя = ВыбранноеЗначение.ОсновнойОбъектАдресации;
		Запись.ДополнительныйОбъектАдресацииИсполнителя = ВыбранноеЗначение.ДополнительныйОбъектАдресации;
	Иначе
		Запись.НазначающийИсполнителей = ВыбранноеЗначение;
		Запись.ОсновнойОбъектАдресацииИсполнителя = "";
		Запись.ДополнительныйОбъектАдресацииИсполнителя = "";
	КонецЕсли;
	
	ВыбранноеЗначение = ПроцессыОбработкиДокументовКлиентСервер.ПредставлениеИсполнителяЭтапа(Запись.РольИсполнителя,
																							Запись.ОсновнойОбъектАдресацииИсполнителя,
																							Запись.ДополнительныйОбъектАдресацииИсполнителя);
	
КонецПроцедуры

&НаКлиенте
Процедура НазначающийИсполнителейОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПоказатьЗначение(, Запись.НазначающийИсполнителей);
КонецПроцедуры

&НаКлиенте
Процедура РольИсполнителяОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПоказатьЗначение(, Запись.РольИсполнителя);
КонецПроцедуры

&НаКлиенте
Процедура НазначающийИсполнителейОчистка(Элемент, СтандартнаяОбработка)
	
	Модифицированность = Истина;
	
	Запись.НазначающийИсполнителей = "";
	Запись.ОсновнойОбъектАдресацииНазначающего = "";
	Запись.ДополнительныйОбъектАдресацииНазначающего = "";
	
КонецПроцедуры

&НаКлиенте
Процедура РольИсполнителяОчистка(Элемент, СтандартнаяОбработка)
	
	Модифицированность = Истина;
	
	Запись.РольИсполнителя = "";
	Запись.ОсновнойОбъектАдресацииИсполнителя = "";
	Запись.ДополнительныйОбъектАдресацииИсполнителя = "";
	
КонецПроцедуры

#КонецОбласти
